# 字符串字面量直接的拼接
print("学it来黑马" + "月薪过万")
# 字符字面量和字符串变量的拼接
name = "黑马程序员"
address = "我也不知道地址在哪"
tel = 94609460
print("我是：" + name + address + "我的电话是：")
# 字符串无法和其他类型进行拼接


# 字符串的格式化
class_num = 20
money = 500
gs = "改学校一共有%s，毕业平均工资：%s" % (class_num, money)
# %为占位，s为将变量化为字符串，合起来的意思是先占位把后面的变量化为字符串并替换占位符
print(gs)

b = 9494
c = 3.14
cw = "读书真的很累诶,%d烦的要死买瓶%f元的水休息一下吧" % (b, c)
print(cw)

# 数字精度控制
b = 9494
c = 3.14
cw = "读书真的很累诶,%5d烦的要死买瓶%.2f元的水休息一下吧" % (b, c)
print(cw)
"""
5这里为长度控制也就是m，这里的意思是控制字符长度为5，然后字符小于则会在前面加空格，大于则不执行操作
.2这里为控制精度也就是所谓的.n这里控制小数点后面的位数为2位,小数小于则会在后面加0
"""